===================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Kernel Shape
===================================================================================================================
MobileNetV1UNet                          [1, 4, 128, 128]          [1, 4, 128, 128]          --
├─Sequential: 1-1                        [1, 4, 128, 128]          [1, 32, 64, 64]           --
│    └─Conv2d: 2-1                       [1, 4, 128, 128]          [1, 32, 64, 64]           [3, 3]
│    └─BatchNorm2d: 2-2                  [1, 32, 64, 64]           [1, 32, 64, 64]           --
│    └─ReLU: 2-3                         [1, 32, 64, 64]           [1, 32, 64, 64]           --
├─DepthwiseSeparableConv: 1-2            [1, 32, 64, 64]           [1, 64, 64, 64]           --
│    └─Conv2d: 2-4                       [1, 32, 64, 64]           [1, 32, 64, 64]           [3, 3]
│    └─Conv2d: 2-5                       [1, 32, 64, 64]           [1, 64, 64, 64]           [1, 1]
│    └─BatchNorm2d: 2-6                  [1, 64, 64, 64]           [1, 64, 64, 64]           --
│    └─ReLU: 2-7                         [1, 64, 64, 64]           [1, 64, 64, 64]           --
├─DepthwiseSeparableConv: 1-3            [1, 64, 64, 64]           [1, 128, 32, 32]          --
│    └─Conv2d: 2-8                       [1, 64, 64, 64]           [1, 64, 32, 32]           [3, 3]
│    └─Conv2d: 2-9                       [1, 64, 32, 32]           [1, 128, 32, 32]          [1, 1]
│    └─BatchNorm2d: 2-10                 [1, 128, 32, 32]          [1, 128, 32, 32]          --
│    └─ReLU: 2-11                        [1, 128, 32, 32]          [1, 128, 32, 32]          --
├─DepthwiseSeparableConv: 1-4            [1, 128, 32, 32]          [1, 128, 32, 32]          --
│    └─Conv2d: 2-12                      [1, 128, 32, 32]          [1, 128, 32, 32]          [3, 3]
│    └─Conv2d: 2-13                      [1, 128, 32, 32]          [1, 128, 32, 32]          [1, 1]
│    └─BatchNorm2d: 2-14                 [1, 128, 32, 32]          [1, 128, 32, 32]          --
│    └─ReLU: 2-15                        [1, 128, 32, 32]          [1, 128, 32, 32]          --
├─DepthwiseSeparableConv: 1-5            [1, 128, 32, 32]          [1, 256, 16, 16]          --
│    └─Conv2d: 2-16                      [1, 128, 32, 32]          [1, 128, 16, 16]          [3, 3]
│    └─Conv2d: 2-17                      [1, 128, 16, 16]          [1, 256, 16, 16]          [1, 1]
│    └─BatchNorm2d: 2-18                 [1, 256, 16, 16]          [1, 256, 16, 16]          --
│    └─ReLU: 2-19                        [1, 256, 16, 16]          [1, 256, 16, 16]          --
├─DepthwiseSeparableConv: 1-6            [1, 256, 16, 16]          [1, 256, 16, 16]          --
│    └─Conv2d: 2-20                      [1, 256, 16, 16]          [1, 256, 16, 16]          [3, 3]
│    └─Conv2d: 2-21                      [1, 256, 16, 16]          [1, 256, 16, 16]          [1, 1]
│    └─BatchNorm2d: 2-22                 [1, 256, 16, 16]          [1, 256, 16, 16]          --
│    └─ReLU: 2-23                        [1, 256, 16, 16]          [1, 256, 16, 16]          --
├─DepthwiseSeparableConv: 1-7            [1, 256, 16, 16]          [1, 512, 8, 8]            --
│    └─Conv2d: 2-24                      [1, 256, 16, 16]          [1, 256, 8, 8]            [3, 3]
│    └─Conv2d: 2-25                      [1, 256, 8, 8]            [1, 512, 8, 8]            [1, 1]
│    └─BatchNorm2d: 2-26                 [1, 512, 8, 8]            [1, 512, 8, 8]            --
│    └─ReLU: 2-27                        [1, 512, 8, 8]            [1, 512, 8, 8]            --
├─DepthwiseSeparableConv: 1-8            [1, 512, 8, 8]            [1, 512, 8, 8]            --
│    └─Conv2d: 2-28                      [1, 512, 8, 8]            [1, 512, 8, 8]            [3, 3]
│    └─Conv2d: 2-29                      [1, 512, 8, 8]            [1, 512, 8, 8]            [1, 1]
│    └─BatchNorm2d: 2-30                 [1, 512, 8, 8]            [1, 512, 8, 8]            --
│    └─ReLU: 2-31                        [1, 512, 8, 8]            [1, 512, 8, 8]            --
├─DepthwiseSeparableConv: 1-9            [1, 512, 8, 8]            [1, 512, 8, 8]            --
│    └─Conv2d: 2-32                      [1, 512, 8, 8]            [1, 512, 8, 8]            [3, 3]
│    └─Conv2d: 2-33                      [1, 512, 8, 8]            [1, 512, 8, 8]            [1, 1]
│    └─BatchNorm2d: 2-34                 [1, 512, 8, 8]            [1, 512, 8, 8]            --
│    └─ReLU: 2-35                        [1, 512, 8, 8]            [1, 512, 8, 8]            --
├─DepthwiseSeparableConv: 1-10           [1, 512, 8, 8]            [1, 512, 8, 8]            --
│    └─Conv2d: 2-36                      [1, 512, 8, 8]            [1, 512, 8, 8]            [3, 3]
│    └─Conv2d: 2-37                      [1, 512, 8, 8]            [1, 512, 8, 8]            [1, 1]
│    └─BatchNorm2d: 2-38                 [1, 512, 8, 8]            [1, 512, 8, 8]            --
│    └─ReLU: 2-39                        [1, 512, 8, 8]            [1, 512, 8, 8]            --
├─DepthwiseSeparableConv: 1-11           [1, 512, 8, 8]            [1, 512, 8, 8]            --
│    └─Conv2d: 2-40                      [1, 512, 8, 8]            [1, 512, 8, 8]            [3, 3]
│    └─Conv2d: 2-41                      [1, 512, 8, 8]            [1, 512, 8, 8]            [1, 1]
│    └─BatchNorm2d: 2-42                 [1, 512, 8, 8]            [1, 512, 8, 8]            --
│    └─ReLU: 2-43                        [1, 512, 8, 8]            [1, 512, 8, 8]            --
├─DepthwiseSeparableConv: 1-12           [1, 512, 8, 8]            [1, 512, 8, 8]            --
│    └─Conv2d: 2-44                      [1, 512, 8, 8]            [1, 512, 8, 8]            [3, 3]
│    └─Conv2d: 2-45                      [1, 512, 8, 8]            [1, 512, 8, 8]            [1, 1]
│    └─BatchNorm2d: 2-46                 [1, 512, 8, 8]            [1, 512, 8, 8]            --
│    └─ReLU: 2-47                        [1, 512, 8, 8]            [1, 512, 8, 8]            --
├─DepthwiseSeparableConv: 1-13           [1, 512, 8, 8]            [1, 1024, 4, 4]           --
│    └─Conv2d: 2-48                      [1, 512, 8, 8]            [1, 512, 4, 4]            [3, 3]
│    └─Conv2d: 2-49                      [1, 512, 4, 4]            [1, 1024, 4, 4]           [1, 1]
│    └─BatchNorm2d: 2-50                 [1, 1024, 4, 4]           [1, 1024, 4, 4]           --
│    └─ReLU: 2-51                        [1, 1024, 4, 4]           [1, 1024, 4, 4]           --
├─DepthwiseSeparableConv: 1-14           [1, 1024, 4, 4]           [1, 1024, 4, 4]           --
│    └─Conv2d: 2-52                      [1, 1024, 4, 4]           [1, 1024, 4, 4]           [3, 3]
│    └─Conv2d: 2-53                      [1, 1024, 4, 4]           [1, 1024, 4, 4]           [1, 1]
│    └─BatchNorm2d: 2-54                 [1, 1024, 4, 4]           [1, 1024, 4, 4]           --
│    └─ReLU: 2-55                        [1, 1024, 4, 4]           [1, 1024, 4, 4]           --
├─Sequential: 1-15                       [1, 1024, 4, 4]           [1, 2048, 4, 4]           --
│    └─Conv2d: 2-56                      [1, 1024, 4, 4]           [1, 2048, 4, 4]           [3, 3]
│    └─ReLU: 2-57                        [1, 2048, 4, 4]           [1, 2048, 4, 4]           --
│    └─Conv2d: 2-58                      [1, 2048, 4, 4]           [1, 2048, 4, 4]           [3, 3]
│    └─ReLU: 2-59                        [1, 2048, 4, 4]           [1, 2048, 4, 4]           --
├─ConvTranspose2d: 1-16                  [1, 2048, 4, 4]           [1, 1024, 8, 8]           [2, 2]
├─Sequential: 1-17                       [1, 2048, 8, 8]           [1, 1024, 8, 8]           --
│    └─Conv2d: 2-60                      [1, 2048, 8, 8]           [1, 1024, 8, 8]           [3, 3]
│    └─ReLU: 2-61                        [1, 1024, 8, 8]           [1, 1024, 8, 8]           --
│    └─Conv2d: 2-62                      [1, 1024, 8, 8]           [1, 1024, 8, 8]           [3, 3]
│    └─ReLU: 2-63                        [1, 1024, 8, 8]           [1, 1024, 8, 8]           --
├─ConvTranspose2d: 1-18                  [1, 1024, 8, 8]           [1, 512, 16, 16]          [2, 2]
├─Sequential: 1-19                       [1, 1024, 16, 16]         [1, 512, 16, 16]          --
│    └─Conv2d: 2-64                      [1, 1024, 16, 16]         [1, 512, 16, 16]          [3, 3]
│    └─ReLU: 2-65                        [1, 512, 16, 16]          [1, 512, 16, 16]          --
│    └─Conv2d: 2-66                      [1, 512, 16, 16]          [1, 512, 16, 16]          [3, 3]
│    └─ReLU: 2-67                        [1, 512, 16, 16]          [1, 512, 16, 16]          --
├─ConvTranspose2d: 1-20                  [1, 512, 16, 16]          [1, 256, 32, 32]          [2, 2]
├─Sequential: 1-21                       [1, 512, 32, 32]          [1, 256, 32, 32]          --
│    └─Conv2d: 2-68                      [1, 512, 32, 32]          [1, 256, 32, 32]          [3, 3]
│    └─ReLU: 2-69                        [1, 256, 32, 32]          [1, 256, 32, 32]          --
│    └─Conv2d: 2-70                      [1, 256, 32, 32]          [1, 256, 32, 32]          [3, 3]
│    └─ReLU: 2-71                        [1, 256, 32, 32]          [1, 256, 32, 32]          --
├─ConvTranspose2d: 1-22                  [1, 256, 32, 32]          [1, 128, 64, 64]          [2, 2]
├─Sequential: 1-23                       [1, 256, 64, 64]          [1, 128, 64, 64]          --
│    └─Conv2d: 2-72                      [1, 256, 64, 64]          [1, 128, 64, 64]          [3, 3]
│    └─ReLU: 2-73                        [1, 128, 64, 64]          [1, 128, 64, 64]          --
│    └─Conv2d: 2-74                      [1, 128, 64, 64]          [1, 128, 64, 64]          [3, 3]
│    └─ReLU: 2-75                        [1, 128, 64, 64]          [1, 128, 64, 64]          --
├─ConvTranspose2d: 1-24                  [1, 128, 64, 64]          [1, 64, 128, 128]         [2, 2]
├─Sequential: 1-25                       [1, 128, 128, 128]        [1, 64, 128, 128]         --
│    └─Conv2d: 2-76                      [1, 128, 128, 128]        [1, 64, 128, 128]         [3, 3]
│    └─ReLU: 2-77                        [1, 64, 128, 128]         [1, 64, 128, 128]         --
│    └─Conv2d: 2-78                      [1, 64, 128, 128]         [1, 64, 128, 128]         [3, 3]
│    └─ReLU: 2-79                        [1, 64, 128, 128]         [1, 64, 128, 128]         --
├─Conv2d: 1-26                           [1, 64, 128, 128]         [1, 4, 128, 128]          [1, 1]
===================================================================================================================
Total params: 108,716,516
Trainable params: 108,716,516
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 12.85
===================================================================================================================
Input size (MB): 0.26
Forward/backward pass size (MB): 71.11
Params size (MB): 434.87
Estimated Total Size (MB): 506.23
===================================================================================================================

